캐글 제공 타이타닉 탑승자 데이터 기반  
1) 캐글 데이터(https://www.kaggle.com/c/titanic/data) 다운로드(00.data폴더)  
2) 데이터 확인  
3) 결손치 처리  
4) 문자열 처리  
5) Survived 속성을 y로 나머지 피쳐를 X로 만듦  
6) 학습/테스트 데이터 세트 분리  
7) 적용할 알고리즘 선정:   
• 결정 트리 – DecisionTreeClassifier  
• 랜덤 포레스트 – RandomForestClassifier  
• 로지스틱 회귀 – LogisticRegression  
8) 학습, 예측 및 평가  
9) 교차 검증  
10) GridSearchCV를 통해 최적 파라미터 도출  

캐글솔루션 https://www.kaggle.com/startupsci/titanic-data-science-solutions

In [52]:
import pandas as pd

In [53]:
train = pd.read_csv('../00.data/train.csv')
print(train.shape)
train.head()

(891, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [54]:
test = pd.read_csv('../00.data/test.csv')
print(test.shape)
test.head()

(418, 11)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [55]:
train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [56]:
test.dtypes

PassengerId      int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [57]:
train['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [58]:
test['Sex'].value_counts()

male      266
female    152
Name: Sex, dtype: int64

In [59]:
train['Sex_encode'] = train['Sex'].replace('male',0).replace('female',1)
train['Sex_encode']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Sex_encode, Length: 891, dtype: int64

In [60]:
test['Sex_encode'] = test['Sex'].replace('male',0).replace('female',1)
test['Sex_encode']

0      0
1      1
2      0
3      0
4      1
      ..
413    0
414    1
415    0
416    0
417    0
Name: Sex_encode, Length: 418, dtype: int64

In [61]:
train['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [62]:
test['Embarked'].value_counts()

S    270
C    102
Q     46
Name: Embarked, dtype: int64

In [64]:
train['Embarked_encode'] = train['Embarked'].replace('S',0).replace('C',1).replace('Q',2)
test['Embarked_encode'] = test['Embarked'].replace('S',0).replace('C',1).replace('Q',2)

In [65]:
numeric = ['PassengerId', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Sex_encode', 'Embarked_encode']

In [66]:
X_train = train[numeric]
X_test = test[numeric]
y_train = train['Survived']

In [67]:
X_train.isnull().sum()

PassengerId          0
Pclass               0
Age                177
SibSp                0
Parch                0
Fare                 0
Sex_encode           0
Embarked_encode      2
dtype: int64

In [68]:
y_train.isnull().sum()

0

In [69]:
X_test.isnull().sum()

PassengerId         0
Pclass              0
Age                86
SibSp               0
Parch               0
Fare                1
Sex_encode          0
Embarked_encode     0
dtype: int64

In [70]:
X_train['Age'] = X_train['Age'].fillna(X_train['Age'].mean())
X_train['Embarked_encode'] = X_train['Embarked_encode'].fillna(0)

In [75]:
X_test['Age'] = X_test['Age'].fillna(X_test['Age'].mean())
X_test['Fare'] = X_test['Fare'].fillna(X_test['Fare'].mean())

In [76]:
from sklearn.tree import DecisionTreeClassifier 
model = DecisionTreeClassifier()
model

DecisionTreeClassifier()

In [77]:
model.fit(X_train, y_train)

DecisionTreeClassifier()

In [78]:
y_test = model.predict(X_test)

In [80]:
submit.to_csv('final_result.csv', index = False)

NameError: name 'submit' is not defined

In [ ]:
https://blog.naver.com/fkdldjs60/221892809660